{
    "lead": "Currently looking for a challenging junior full stack developer position",
    "myProjectsHeading":"My tech stack includes Java, Spring, Hibernate, Javascript, HTML, CSS, and some Node.js. I'm more than willing to learn frameworks such as Angular or React.",
    "myProjects": "My projects",
    "copernicanaHeading": "App for tourist groups management",
    "copernicanaText1": "Technologies used: Java, JSP, Spring Boot 1.58, Spring Security, MySQL, H2, Bootstrap 3",
    "copernicanaText2": "Application for a touroperator which simplifies work with tourist groups. From a begining developer's point of view the most interesting part was using Spring Profiles. Project was divided into 3 profiles dev, staging and production with corresponding git braches and Heroku apps.",
    "copernicanaText3": "Tables in the view layer are generated with Datatables library, other components are based on Bootstrap. Additional features are handled by AJAXpoiis.",

    "poisHeading": "Interactive guide",
    "poisText1": "Technologies used: Java, Spring, JSP, Hibernate, MySQL, Bootstrap 3.3.7, Google Geocoding API",
    "poisText2": "App presents points of interest near place chosen by user.",
    "poisText3": "Range of coordinates in the chosen radius is calculated on the server, then fitting records are queried from MySQL database containing approx. 18 000 entries.",

    "productsHeading":"App that enables user to aggregate, share and download marketing product content.",
    "productsText1":"Technologies used: Java, Spring, JSP, Hibernate, Jsoup, Apache POI, Postgres, Amazon AWS, Mailgun",
    "productsText2":"Program scrapes website in real time and packages data into zip files containing xls files and images.",
    "productsText3":"Zip files with data are hosted on Amazon S3 handled by Java API.",

    "poibotHeading":"Bot dla FB Messenger z funkcjonalnościa projektu POI Guide",
    "poibotText1":"Technologies used: Node.js, MySQL",
    "poibotText2":"Program realizujący funkcjonalność aplikacji POI Gude, ale z wykorzystaniem platformy botowej Facebooka.",
    "poibotText3":"Backend obsługiwany jest przez Node.js w połączeniu z bazą MySQL.",


    "reportsTitle": "Reporting app",
    "reportsHeading": "Internal data warehouse",
    "reportsText1": "Technologies used: Oracle PL/SQL, MS SQL Server, Oracle APEX",
    "reportsText2": "App build and designed as part of team assignment. It acts as a small data warehouse for reporting needs of National Fund for Environmental Protection and Water Management.",
    "reportsText3": "Program fetches data from production database, processes it and provides handy report builder for accessing information.",

    "softHeading":"Website of pillow manufacturer",
    "softText1":"Scope of work included animating svg logo and localization of content.",
    "softText2":"Logo is animated using vivus.js lib, information about animation display is hold in local storage so that svg is not shown after page reload. Text localization is  made with localize.js, which enables to serve content from json files in selected languages. Default language is chosen by own script, as well as localization of placeholders in contact form.",
    "softText3":"Visit site",

    "contactMenu":"Contact"



}
