{
    "lead": "Szukam pracy jako junior full stack developer",
    "myProjectsHeading":"Zakres poznanych technologii to: Java, Spring, Hibernate, Javascript, HTML, CSS, oraz podstawy some Node.js. Chętnie nauczę się frameworków JS np. React i Angular.",
    "myProjects": "Moje projekty",
    "copernicanaHeading": "Aplikacja do zarządzania grupami wycieczkowymi",
    "copernicanaText1": "Wykorzystane technologie: Java, JSP, Spring Boot 1.58, Spring Security, MySQL, H2, Bootstrap 3",
    "copernicanaText2": "Program dla touroperatora ułatwiający zarządzanie grupami turystów. Z punktu widzenia początkującego developera najciekawsze było użycie funkcji Spring Profiles. Projekt podzieliłem na profile dev, staging oraz production z odpowiednimi branchami git oraz stosownymi aplikacjami na Heroku.",
    "copernicanaText3": "Tabele w warstwie widoku generowane są za pomocą biblioteki Datatables, pozostałe komponenty za pomocą Boostrapa. Dodatkowo wybrane funkcjonalności realizowane są poprzez AJAX.",

    "poisHeading": "Przewodnik interaktywny",
    "poisText1": "Wykorzystane technologie: Java, Spring, JSP, Hibernate, MySQL, Bootstrap 3.3.7, Google Geocoding API",
    "poisText2": "Aplikacja prezentująca intersujące punkty w poblizu miejsca wskazanego przez użytkownika.",
    "poisText3": "Zakres współrzędnych znajdujących się w obszarze interesującym użytkownika obliczany jest na serwerze, następnie potrzebne rekordy pobierane są z bazy danych.Baza zawiera około 18 000 rekordów.",

    "productsHeading":"Aplikacja pozwalająca agregować i udostępniać tresci produktowe",
    "productsText1":"Wykorzystane technologie: Java, Spring, JSP, Hibernate, Jsoup, Apache POI, Postgres, Amazon AWS, Mailgun",
    "productsText2":"Aplikacja w locie pobiera dane ze strony internetowej i pozwala pobrać je w formie paczki materiałów zip",
    "productsText3":"Pliki zip zawierające obrazy, pliki xls i inne hostowane są na Amazon S3 obsługiwane przez Java API.",

    "poibotHeading":"Strona motokariera.pl",
    "poibotText1":"Wykorzystane technologie: Java, Spring Boot, Apache Tika, Spring Data JPA",
    "poibotText2":"Strona wspomagająca rekrutację w branży motoryzacyjnej. Umożliwia logowanie, aplikowanie na oferty, zarządzanie ofertami, itp.",
    "poibotText3":"Zgodna z wymogami RODO, pozwala również na wyszukiwanie słów kluczowych w przesłanych cv kandydatów w różnych formatach.",


    "reportsTitle": "Efekty środowiskowe",
    "reportsHeading": "Wewnętrzna aplikacja raportowa",
    "reportsText1": "Wykorzystane technologie: Oracle PL/SQL, MS SQL Server, Oracle APEX",
    "reportsText2": "Aplikacja wykonana w ramach pracy zespołowej. Pełni rolę niewielkiej hurtowni danych na potrzeby raportowe Narodowego Funduszu Ochrony Środowiska i Gospodarki Wodnej.",
    "reportsText3": "Program pobiera dane z bazy produkcyjnej, przetwarza je i usdostępnia w formie wygodnego kreatora raportów.",

    "softHeading":"Strona www producenta poduszek dekoracyjnych",
    "softText1":"Zakres pracy obejmował stworzenie animacji loga w formacie svg oraz lokalizację zawartości.",
    "softText2":"Logo animowane jest za pomocą biblioteki vivus.js, informacja o wyświetleniu animacji przechowywana jest w local storage tak aby animacja nie pokazywała się po przeładowaniu strony. Lokalizacja teskstów wykonana jest za pomcą pluginu localize.js, który pozwala serwować treści w wybranym języku, przechowywane w formacie json. Automatyczny wybór języka na podstawie języka przeglądarki realizowany jest własnym skryptem, podobnie tłumaczenie placeholderów w formularzu kontaktowym.",
    "softText3":"Odwiedź stronę",

    "contactMenu":"Kontakt"



}
